---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ProfileFailures
source: html/0e31a500-9938-9bd2-e337-5ff8e7f5a5d4.htm
---
# BuiltInFailures.ProfileFailures Properties

Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time.